espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_fcfg1.h
/******************************************************************************
*  Filename:       hw_fcfg1_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_FCFG1_H__
#define __HW_FCFG1_H__

//*****************************************************************************
//
// This section defines the register offsets of
// FCFG1 component
//
//*****************************************************************************
// Misc configurations
#define FCFG1_O_MISC_CONF_1                                         0x000000A0

// Internal
#define FCFG1_O_MISC_CONF_2                                         0x000000A4

// Internal
#define FCFG1_O_HPOSC_MEAS_5                                        0x000000B0

// Internal
#define FCFG1_O_HPOSC_MEAS_4                                        0x000000B4

// Internal
#define FCFG1_O_HPOSC_MEAS_3                                        0x000000B8

// Internal
#define FCFG1_O_HPOSC_MEAS_2                                        0x000000BC

// Internal
#define FCFG1_O_HPOSC_MEAS_1                                        0x000000C0

// Internal
#define FCFG1_O_CONFIG_CC26_FE                                      0x000000C4

// Internal
#define FCFG1_O_CONFIG_CC13_FE                                      0x000000C8

// Internal
#define FCFG1_O_CONFIG_RF_COMMON                                    0x000000CC

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV2_CC26_2G4                          0x000000D0

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV2_CC13_2G4                          0x000000D4

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV2_CC26_1G                           0x000000D8

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV2_CC13_1G                           0x000000DC

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV4_CC26                              0x000000E0

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV4_CC13                              0x000000E4

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV5                                   0x000000E8

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV6_CC26                              0x000000EC

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV6_CC13                              0x000000F0

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV10                                  0x000000F4

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV12_CC26                             0x000000F8

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV12_CC13                             0x000000FC

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV15                                  0x00000100

// Internal
#define FCFG1_O_CONFIG_SYNTH_DIV30                                  0x00000104

// IO Configuration
#define FCFG1_O_IOCONF                                              0x00000144

// User Identification.
#define FCFG1_O_USER_ID                                             0x00000294

// Internal
#define FCFG1_O_FLASH_OTP_DATA3                                     0x000002B0

// Internal
#define FCFG1_O_ANA2_TRIM                                           0x000002B4

// Internal
#define FCFG1_O_LDO_TRIM                                            0x000002B8

// MAC BLE Address 0
#define FCFG1_O_MAC_BLE_0                                           0x000002E8

// MAC BLE Address 1
#define FCFG1_O_MAC_BLE_1                                           0x000002EC

// MAC IEEE 802.15.4 Address 0
#define FCFG1_O_MAC_15_4_0                                          0x000002F0

// MAC IEEE 802.15.4 Address 1
#define FCFG1_O_MAC_15_4_1                                          0x000002F4

// Miscellaneous Trim  Parameters
#define FCFG1_O_MISC_TRIM                                           0x0000030C

// Internal
#define FCFG1_O_RCOSC_HF_TEMPCOMP                                   0x00000310

// IcePick Device Identification
#define FCFG1_O_ICEPICK_DEVICE_ID                                   0x00000318

// Factory Configuration (FCFG1) Revision
#define FCFG1_O_FCFG1_REVISION                                      0x0000031C

// Misc OTP Data
#define FCFG1_O_MISC_OTP_DATA                                       0x00000320

// Internal
#define FCFG1_O_CONFIG_IF_ADC                                       0x0000034C

// Internal
#define FCFG1_O_CONFIG_OSC_TOP                                      0x00000350

