espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_fcfg1.h
// Field: [21:20] DBLR_LOOP_FILTER_RESET_VOLTAGE
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_W               2
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_M      0x00300000
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_S              20

// Field: [19:10] HPM_IBIAS_WAIT_CNT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_W                          10
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_M                  0x000FFC00
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_S                          10

// Field:   [9:4] LPM_IBIAS_WAIT_CNT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_W                           6
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_M                  0x000003F0
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_S                           4

// Field:   [3:0] IDAC_STEP
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_W                                    4
#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_M                           0x0000000F
#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_S                                    0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_0
//
//*****************************************************************************
// Field:  [31:0] ID_31_0
//
// Shadow of DIE_ID_0 register in eFuse row number 5
#define FCFG1_SHDW_DIE_ID_0_ID_31_0_W                                       32
#define FCFG1_SHDW_DIE_ID_0_ID_31_0_M                               0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_0_ID_31_0_S                                        0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_1
//
//*****************************************************************************
// Field:  [31:0] ID_63_32
//
// Shadow of DIE_ID_1 register in eFuse row number 6
#define FCFG1_SHDW_DIE_ID_1_ID_63_32_W                                      32
#define FCFG1_SHDW_DIE_ID_1_ID_63_32_M                              0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_1_ID_63_32_S                                       0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_2
//
//*****************************************************************************
// Field:  [31:0] ID_95_64
//
// Shadow of DIE_ID_2 register in eFuse row number 7
#define FCFG1_SHDW_DIE_ID_2_ID_95_64_W                                      32
#define FCFG1_SHDW_DIE_ID_2_ID_95_64_M                              0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_2_ID_95_64_S                                       0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_3
//
//*****************************************************************************
// Field:  [31:0] ID_127_96
//
// Shadow of DIE_ID_3 register in eFuse row number 8
#define FCFG1_SHDW_DIE_ID_3_ID_127_96_W                                     32
#define FCFG1_SHDW_DIE_ID_3_ID_127_96_M                             0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_3_ID_127_96_S                                      0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_SCAN_MCU3_SEC
//
//*****************************************************************************
// Field: [31:24] SECURITY
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_SCAN_MCU3_SEC_SECURITY_W                                  8
#define FCFG1_SHDW_SCAN_MCU3_SEC_SECURITY_M                         0xFF000000
#define FCFG1_SHDW_SCAN_MCU3_SEC_SECURITY_S                                 24

// Field: [22:11] ULL_MCU_RAM_0_REP
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_SCAN_MCU3_SEC_ULL_MCU_RAM_0_REP_W                        12
#define FCFG1_SHDW_SCAN_MCU3_SEC_ULL_MCU_RAM_0_REP_M                0x007FF800
#define FCFG1_SHDW_SCAN_MCU3_SEC_ULL_MCU_RAM_0_REP_S                        11

// Field:  [10:0] ULL_MCU_RAM_1_REP_1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_SCAN_MCU3_SEC_ULL_MCU_RAM_1_REP_1_W                      11
#define FCFG1_SHDW_SCAN_MCU3_SEC_ULL_MCU_RAM_1_REP_1_M              0x000007FF
#define FCFG1_SHDW_SCAN_MCU3_SEC_ULL_MCU_RAM_1_REP_1_S                       0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_SCAN_DATA1_CRC
//
//*****************************************************************************
// Field:    [31] FLASH_RDY
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_SCAN_DATA1_CRC_FLASH_RDY                         0x80000000
#define FCFG1_SHDW_SCAN_DATA1_CRC_FLASH_RDY_BITN                            31
#define FCFG1_SHDW_SCAN_DATA1_CRC_FLASH_RDY_M                       0x80000000
#define FCFG1_SHDW_SCAN_DATA1_CRC_FLASH_RDY_S                               31

// Field:   [8:1] CRC
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_SCAN_DATA1_CRC_CRC_W                                      8
#define FCFG1_SHDW_SCAN_DATA1_CRC_CRC_M                             0x000001FE
#define FCFG1_SHDW_SCAN_DATA1_CRC_CRC_S                                      1

// Field:     [0] TAP_DAP_LOCK_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_SCAN_DATA1_CRC_TAP_DAP_LOCK_N                    0x00000001
#define FCFG1_SHDW_SCAN_DATA1_CRC_TAP_DAP_LOCK_N_BITN                        0
#define FCFG1_SHDW_SCAN_DATA1_CRC_TAP_DAP_LOCK_N_M                  0x00000001
#define FCFG1_SHDW_SCAN_DATA1_CRC_TAP_DAP_LOCK_N_S                           0

//*****************************************************************************
//
// Register: FCFG1_O_DAC_BIAS_CNF
//
//*****************************************************************************
// Field: [17:12] LPM_TRIM_IOUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_BIAS_CNF_LPM_TRIM_IOUT_W                                   6
#define FCFG1_DAC_BIAS_CNF_LPM_TRIM_IOUT_M                          0x0003F000
#define FCFG1_DAC_BIAS_CNF_LPM_TRIM_IOUT_S                                  12

// Field:  [11:9] LPM_BIAS_WIDTH_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_WIDTH_TRIM_W                             3
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_WIDTH_TRIM_M                    0x00000E00
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_WIDTH_TRIM_S                             9

// Field:     [8] LPM_BIAS_BACKUP_EN
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_BACKUP_EN                       0x00000100
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_BACKUP_EN_BITN                           8
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_BACKUP_EN_M                     0x00000100
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_BACKUP_EN_S                              8

//*****************************************************************************
//
// Register: FCFG1_O_TFW_PROBE
//
//*****************************************************************************
// Field:  [31:0] REV
//
// Internal. Only to be used through TI provided API.
#define FCFG1_TFW_PROBE_REV_W                                               32
#define FCFG1_TFW_PROBE_REV_M                                       0xFFFFFFFF
#define FCFG1_TFW_PROBE_REV_S                                                0

//*****************************************************************************
//
// Register: FCFG1_O_TFW_FT
//
//*****************************************************************************
// Field:  [31:0] REV
//
// Internal. Only to be used through TI provided API.
#define FCFG1_TFW_FT_REV_W                                                  32
#define FCFG1_TFW_FT_REV_M                                          0xFFFFFFFF
#define FCFG1_TFW_FT_REV_S                                                   0

//*****************************************************************************
//
// Register: FCFG1_O_DAC_CAL0
//
//*****************************************************************************
// Field: [31:16] SOC_DAC_VOUT_CAL_DECOUPLE_C2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C2_W                       16
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C2_M               0xFFFF0000
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C2_S                       16

// Field:  [15:0] SOC_DAC_VOUT_CAL_DECOUPLE_C1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C1_W                       16
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C1_M               0x0000FFFF
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C1_S                        0

//*****************************************************************************
//
// Register: FCFG1_O_DAC_CAL1
//
//*****************************************************************************
// Field: [31:16] SOC_DAC_VOUT_CAL_PRECH_C2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C2_W                          16
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C2_M                  0xFFFF0000
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C2_S                          16

// Field:  [15:0] SOC_DAC_VOUT_CAL_PRECH_C1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C1_W                          16
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C1_M                  0x0000FFFF
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C1_S                           0

//*****************************************************************************
//
// Register: FCFG1_O_DAC_CAL2
//
//*****************************************************************************
// Field: [31:16] SOC_DAC_VOUT_CAL_ADCREF_C2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C2_W                         16
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C2_M                 0xFFFF0000
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C2_S                         16

// Field:  [15:0] SOC_DAC_VOUT_CAL_ADCREF_C1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C1_W                         16
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C1_M                 0x0000FFFF
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C1_S                          0

//*****************************************************************************
//
// Register: FCFG1_O_DAC_CAL3
//
//*****************************************************************************
// Field: [31:16] SOC_DAC_VOUT_CAL_VDDS_C2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C2_W                           16
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C2_M                   0xFFFF0000
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C2_S                           16

// Field:  [15:0] SOC_DAC_VOUT_CAL_VDDS_C1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C1_W                           16
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C1_M                   0x0000FFFF
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C1_S                            0


#endif // __FCFG1__
